src/InformationRegisters/КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Работает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КадроваяИсторияСотрудников/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Параметры:
//  сотрудникСсылка - СправочникСсылка.Сотрудники
//  моментВремени - Дата, МоментВремени, Граница, Неопределено
// Возвращаемое значение:
//  - Число, Неопределено
Функция ПолучитьОкладСотрудника(Знач сотрудникСсылка, Знач моментВремени = Неопределено) Экспорт
    кадровыеДанныеСотрудника = ПолучитьКадровыеДанныеСотрудника(сотрудникСсылка, моментВремени);
    Если кадровыеДанныеСотрудника = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;

    Возврат кадровыеДанныеСотрудника.Оклад;
КонецФункции

// Параметры:
//  сотрудникСсылка - СправочникСсылка.Сотрудники
//  моментВремени - Дата, МоментВремени, Граница, Неопределено
// Возвращаемое значение:
//  - Структура, Неопределено
Функция ПолучитьКадровыеДанныеСотрудника(Знач сотрудникСсылка, Знач моментВремени = Неопределено) Экспорт
    поляДанных = "Период, ГрафикРаботы, Оклад, Работает";
    структураПолей = Новый Структура(поляДанных);
    выборка = ПолучитьКадровыеДанные(структураПолей, Новый Структура("Сотрудник, МоментВремени", сотрудникСсылка, моментВремени), Ложь);

    Если выборка = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;

    выборка.Следующий();
    ЗаполнитьЗначенияСвойств(структураПолей, выборка, поляДанных);

    Возврат структураПолей;
КонецФункции

// Параметры:
//  структураПолей - Структура, ФиксированнаяСтруктура
//  параметры - Структура, ФиксированнаяСтруктура
//      * МоментВремени - Дата, МоментВремени, Граница, Неопределено
//      * Сотрудник - СправочникСсылка.Сотрудники, Неопределено
//      * График - СправочникСсылка.ГрафикиРаботыСотрудников, Неопределено
//      * ВыбратьРазрешенные - Булево
//  выгрузить - Булево - Если Истина - результат будет возвращен в виде ТаблицаЗначений, по умолчанию: Истина
// Возвращаемое значение:
//  - ТаблицаЗначений, ВыборкаИзРезультатаЗапроса, Неопределено
Функция ПолучитьКадровыеДанные(Знач структураПолей, Знач параметры, выгрузить = Неопределено) Экспорт
    Возврат получитьДанныеРегистра("СрезПоследних", структураПолей, параметры, выгрузить);
КонецФункции

// Параметры:
//  структураПолей - Структура, ФиксированнаяСтруктура
//  параметры - Структура, ФиксированнаяСтруктура
//      * НачалоПериода - Дата, МоментВремени, Граница
//      * КонецПериода - Дата, МоментВремени, Граница
//      * Сотрудник - СправочникСсылка.Сотрудники, Неопределено
//      * График - СправочникСсылка.ГрафикиРаботыСотрудников, Неопределено
//      * ВыбратьРазрешенные - Булево
//  выгрузить - Булево - Если Истина - результат будет возвращен в виде ТаблицаЗначений, по умолчанию: Истина
// Возвращаемое значение:
//  - ТаблицаЗначений, ВыборкаИзРезультатаЗапроса, Неопределено
Функция ПолучитьИсториюЗаПериод(Знач структураПолей, Знач параметры, выгрузить = Неопределено) Экспорт
    Возврат получитьДанныеРегистра("История", структураПолей, параметры, выгрузить);
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  видЗапроса - Строка
//  структураПолей - Структура, ФиксированнаяСтруктура
//  параметры - Структура, ФиксированнаяСтруктура
//  выгрузить - Булево - Если Истина - результат будет возвращен в виде ТаблицаЗначений, по умолчанию: Истина
// Возвращаемое значение:
//  - ТаблицаЗначений, ВыборкаИзРезультатаЗапроса, Неопределено
Функция получитьДанныеРегистра(Знач видЗапроса, Знач структураПолей, Знач параметры, выгрузить = Неопределено)
    выгрузить = ?(выгрузить = Неопределено, Истина, выгрузить);

    запрос = Неопределено;
    Если видЗапроса = "История" Тогда
        запрос = сформироватьЗапросИсторииПоРеквизитам(структураПолей, параметры);
    ИначеЕсли видЗапроса = "СрезПоследних" Тогда
        запрос = сформироватьЗапросСрезПоследнихПоРеквизитам(структураПолей, параметры);
    Иначе
        ДиагностикаКлиентСервер.Утверждение(Ложь,
            СтрШаблон("Указанный вид запроса: ""%1"" не поддерживается.", Строка(видЗапроса)));
    КонецЕсли;
    ДиагностикаКлиентСервер.Утверждение(запрос <> Неопределено,
        "Ошибка при формировании запроса на получение данных регистра.");

    результатЗапроса = запрос.Выполнить();

    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    Если выгрузить Тогда
        Возврат результатЗапроса.Выгрузить();
    Иначе
        Возврат результатЗапроса.Выбрать();
    КонецЕсли;
КонецФункции

// Параметры:
//  структураПолей - Структура, ФиксированнаяСтруктура
//  параметры - Структура, ФиксированнаяСтруктура
//      * МоментВремени - Дата, МоментВремени, Граница, Неопределено
//      * Сотрудник - СправочникСсылка.Сотрудники, Неопределено
//      * График - СправочникСсылка.ГрафикиРаботыСотрудников, Неопределено
//      * ВыбратьРазрешенные - Булево
// Возвращаемое значение:
//  - Запрос
Функция сформироватьЗапросСрезПоследнихПоРеквизитам(Знач структураПолей, Знач параметры)
    параметры = ?(параметры = Неопределено, Новый Структура("МоментВремени, ВыбратьРазрешенные", Неопределено, Ложь), параметры);

    #Область Диагностика
    выполнитьДиагностикуСтруктурыПолей(структураПолей);
    ДиагностикаКлиентСервер.Утверждение(
        ТипЗнч(параметры) = Тип("Структура") ИЛИ ТипЗнч(параметры) = Тип("ФиксированнаяСтруктура"),
            "Аргумент ""Параметры"" должен иметь тип ""[Фиксированная]Структура"".");
    #КонецОбласти // Диагностика

    выбратьРазрешенные = ?(параметры.Свойство("ВыбратьРазрешенные"), параметры.ВыбратьРазрешенные, Ложь);
    моментВремени = ?(параметры.Свойство("МоментВремени"), параметры.МоментВремени, Неопределено);
    сотрудник = ?(параметры.Свойство("Сотрудник"), параметры.Сотрудник, Неопределено);
    график = ?(параметры.Свойство("График"), параметры.График, Неопределено);
    условие = Неопределено;

    текстЗапросаПолей = РаботаСРеквизитами.СформироватьТекстЗапросаПолейПоРеквизитам(
            структураПолей, "КадроваяИсторияСотрудниковСрезПоследних");
    текстЗапросаПолей = ?(ПустаяСтрока(текстЗапросаПолей), "*", текстЗапросаПолей);

    запрос = Новый Запрос;
    запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |&ТекстЗапросаПолей
        |ИЗ
        |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ПараметрыВТ) КАК КадроваяИсторияСотрудниковСрезПоследних
        |";

    параметрыВТ = "&МоментВремени, &Условие";

    Если моментВремени = Неопределено Тогда
        параметрыВТ = СтрЗаменить(параметрыВТ, "&МоментВремени", "");
    Иначе
        запрос.УстановитьПараметр("МоментВремени", моментВремени);
    КонецЕсли;

    Если сотрудник <> Неопределено Тогда
        условие = СтрШаблон("Сотрудник %1 &Сотрудник", ?(РаботаСКоллекциямиКлиентСервер.ЭтоМассив(сотрудник, Ложь), "В", "="));
        запрос.УстановитьПараметр("Сотрудник", сотрудник);
    КонецЕсли;

    Если график <> Неопределено Тогда
        условие = СтрШаблон("%1 %2%3", условие, ?(условие <> Неопределено, "И ", ""), "График = &График");
        запрос.УстановитьПараметр("График", график);
    КонецЕсли;

    Если НЕ выбратьРазрешенные Тогда
        запрос.Текст = СтрЗаменить(запрос.Текст, "РАЗРЕШЕННЫЕ", "");
    КонецЕсли;

    параметрыВТ = СтрЗаменить(параметрыВТ, "&Условие", ?(условие = Неопределено, "", условие));

    запрос.Текст = СтрЗаменить(запрос.Текст, "&ПараметрыВТ", параметрыВТ);
    запрос.Текст = СтрЗаменить(запрос.Текст, "&ТекстЗапросаПолей", текстЗапросаПолей);

    Возврат запрос;
КонецФункции

// Параметры:
//  структураПолей - Структура, ФиксированнаяСтруктура, Неопределено
//  параметры - Структура, ФиксированнаяСтруктура
//      * НачалоПериода - Дата, МоментВремени, Граница
//      * КонецПериода - Дата, МоментВремени, Граница
//      * Сотрудник - СправочникСсылка.Сотрудники, Неопределено
//      * График - СправочникСсылка.ГрафикиРаботыСотрудников, Неопределено
//      * ВыбратьРазрешенные - Булево
// Возвращаемое значение:
//  - Запрос
Функция сформироватьЗапросИсторииПоРеквизитам(Знач структураПолей, Знач параметры)
    #Область Диагностика
    выполнитьДиагностикуСтруктурыПолей(структураПолей);
    ДиагностикаКлиентСервер.Утверждение(
        ТипЗнч(параметры) = Тип("Структура") ИЛИ ТипЗнч(параметры) = Тип("ФиксированнаяСтруктура"),
            "Аргумент ""Параметры"" должен иметь тип ""[Фиксированная]Структура"".");
    #КонецОбласти // Диагностика

    выбратьРазрешенные = ?(параметры.Свойство("ВыбратьРазрешенные"), параметры.ВыбратьРазрешенные, Ложь);
    сотрудник = ?(параметры.Свойство("Сотрудник"), параметры.Сотрудник, Неопределено);
    график = ?(параметры.Свойство("График"), параметры.График, Неопределено);
    условие = Неопределено;

    текстЗапросаПолей = Неопределено;

    Если структураПолей = Неопределено Тогда
        текстЗапросаПолей =
            "
            |   КадроваяИсторияСотрудников.Период КАК Период,
            |	КадроваяИсторияСотрудников.Сотрудник КАК Сотрудник,
            |	КадроваяИсторияСотрудников.ГрафикРаботы КАК ГрафикРаботы,
            |	КадроваяИсторияСотрудников.Оклад КАК Оклад,
            |	КадроваяИсторияСотрудников.Работает КАК Работает
            |";
    Иначе
        текстЗапросаПолей = РаботаСРеквизитами.СформироватьТекстЗапросаПолейПоРеквизитам(
                структураПолей, "КадроваяИсторияСотрудников");
    КонецЕсли;

    ДиагностикаКлиентСервер.Утверждение(текстЗапросаПолей <> Неопределено И ПустаяСтрока(текстЗапросаПолей),
        "Текст запроса полей должен быть заполнен.");

    запрос = Новый Запрос;
    запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |&ТекстЗапросаПолей
        |ИЗ
        |	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
        |ГДЕ
        |   КадроваяИсторияСотрудников.Период МЕЖДУ &НачалоПериода И &КонецПериода
        |   И &Условие
        |
        |УПОРЯДОЧИТЬ ПО
        |   КадроваяИсторияСотрудников.Период
        |";

    Если НЕ выбратьРазрешенные Тогда
        запрос.Текст = СтрЗаменить(запрос.Текст, "РАЗРЕШЕННЫЕ", "");
    КонецЕсли;

    Если сотрудник <> Неопределено Тогда
        условие = СтрШаблон("И Сотрудник %1 &Сотрудник", ?(РаботаСКоллекциямиКлиентСервер.ЭтоМассив(сотрудник, Ложь), "В", "="));
        запрос.УстановитьПараметр("Сотрудник", сотрудник);
    КонецЕсли;

    Если график <> Неопределено Тогда
        условие = СтрШаблон("%1 %2%3", условие, ?(условие <> Неопределено, "И ", ""), "График = &График");
        запрос.УстановитьПараметр("График", график);
    КонецЕсли;

    запрос.Текст = СтрЗаменить(запрос.Текст, "И &Условие", ?(условие = Неопределено, "", условие));
    запрос.Текст = СтрЗаменить(запрос.Текст, "&ТекстЗапросаПолей", текстЗапросаПолей);

    Возврат запрос;
КонецФункции

Процедура выполнитьДиагностикуСтруктурыПолей(Знач структураПолей)
    ДиагностикаКлиентСервер.Утверждение(
        ТипЗнч(структураПолей) = Тип("Структура") ИЛИ ТипЗнч(структураПолей) = Тип("ФиксированнаяСтруктура"),
            "Аргумент ""СтруктураПолей"" должен иметь тип ""[Фиксированная]Структура"".");
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
